const citylist = {
    "result": "1",
    "type": "1",
    "message": "请求成功",
    "data": {
    "hot_city": [
    "北京",
    "天津",
    "上海",
    "衢州",
    "亳州",
    "广州",
    "深圳",
    "泸州",
    "氹仔岛"
    ],
    "city": [
    {
    "letter": "A",
    "citylist": [
    "安庆",
    "安康",
    "安阳",
    "安顺",
    "澳门半岛",
    "阿克苏",
    "阿勒泰",
    "阿坝",
    "阿拉善盟",
    "阿里",
    "鞍山"
    ]
    },
    {
    "letter": "B",
    "citylist": [
    "保定",
    "保山",
    "包头",
    "北京",
    "北海",
    "博尔塔拉",
    "宝鸡",
    "巴中",
    "巴彦淖尔",
    "巴音郭楞",
    "本溪",
    "毕节",
    "滨州",
    "白城",
    "白山",
    "白银",
    "百色",
    "蚌埠"
    ]
    },
    {
    "letter": "C",
    "citylist": [
    "崇左",
    "常州",
    "常德",
    "成都",
    "承德",
    "昌吉",
    "昌都",
    "朝阳",
    "楚雄",
    "池州",
    "沧州",
    "滁州",
    "潮州",
    "赤峰",
    "郴州",
    "长春",
    "长沙",
    "长治"
    ]
    },
    {
    "letter": "D",
    "citylist": [
    "东莞",
    "东营",
    "丹东",
    "大兴安岭",
    "大同",
    "大庆",
    "大理",
    "大连",
    "定西",
    "德宏",
    "德州",
    "德阳",
    "达州",
    "迪庆"
    ]
    },
    {
    "letter": "E",
    "citylist": [
    "恩施",
    "鄂尔多斯",
    "鄂州"
    ]
    },
    {
    "letter": "F",
    "citylist": [
    "佛山",
    "抚州",
    "抚顺",
    "福州",
    "阜新",
    "阜阳",
    "防城港"
    ]
    },
    {
    "letter": "G",
    "citylist": [
    "固原",
    "广元",
    "广安",
    "广州",
    "果洛",
    "桂林",
    "甘南",
    "甘孜",
    "贵港",
    "贵阳",
    "赣州",
    "高雄"
    ]
    },
    {
    "letter": "H",
    "citylist": [
    "合肥",
    "呼伦贝尔",
    "呼和浩特",
    "和田",
    "哈密",
    "哈尔滨",
    "怀化",
    "惠州",
    "杭州",
    "汉中",
    "河池",
    "河源",
    "海东",
    "海北",
    "海南",
    "海口",
    "海西",
    "淮北",
    "淮南",
    "淮安",
    "湖州",
    "红河",
    "花王堂",
    "花莲",
    "菏泽",
    "葫芦岛",
    "衡水",
    "衡阳",
    "贺州",
    "邯郸",
    "鹤壁",
    "鹤岗",
    "黄冈",
    "黄南",
    "黄山",
    "黄石",
    "黑河"
    ]
    },
    {
    "letter": "I",
    "citylist": []
    },
    {
    "letter": "J",
    "citylist": [
    "九江",
    "九龙",
    "佳木斯",
    "吉安",
    "吉林",
    "嘉义",
    "嘉兴",
    "嘉峪关",
    "基隆",
    "揭阳",
    "晋中",
    "晋城",
    "景德镇",
    "江门",
    "济南",
    "济宁",
    "焦作",
    "荆州",
    "荆门",
    "酒泉",
    "金华",
    "金昌",
    "金普新区",
    "金门",
    "锦州",
    "鸡西"
    ]
    },
    {
    "letter": "K",
    "citylist": [
    "克孜勒苏",
    "克拉玛依",
    "喀什",
    "开封",
    "昆明"
    ]
    },
    {
    "letter": "L",
    "citylist": [
    "两江新区",
    "临夏",
    "临汾",
    "临沂",
    "临沧",
    "丽水",
    "丽江",
    "乐山",
    "六安",
    "六盘水",
    "兰州",
    "凉山",
    "吕梁",
    "娄底",
    "廊坊",
    "拉萨",
    "来宾",
    "林芝",
    "柳州",
    "洛阳",
    "聊城",
    "莱芜",
    "路氹填海",
    "路环岛",
    "辽源",
    "辽阳",
    "连云港",
    "连江",
    "陇南",
    "龙岩"
    ]
    },
    {
    "letter": "M",
    "citylist": [
    "梅州",
    "牡丹江",
    "眉山",
    "绵阳",
    "苗栗",
    "茂名",
    "马鞍山"
    ]
    },
    {
    "letter": "N",
    "citylist": [
    "内江",
    "南京",
    "南充",
    "南宁",
    "南平",
    "南投",
    "南昌",
    "南通",
    "南阳",
    "宁德",
    "宁波",
    "怒江",
    "那曲"
    ]
    },
    {
    "letter": "O",
    "citylist": []
    },
    {
    "letter": "P",
    "citylist": [
    "屏东",
    "平凉",
    "平顶山",
    "攀枝花",
    "普洱",
    "澎湖",
    "盘锦",
    "莆田",
    "萍乡"
    ]
    },
    {
    "letter": "Q",
    "citylist": [
    "七台河",
    "庆阳",
    "曲靖",
    "泉州",
    "清远",
    "秦皇岛",
    "钦州",
    "青岛",
    "黔东南",
    "黔南",
    "黔西南",
    "齐齐哈尔"
    ]
    },
    {
    "letter": "R",
    "citylist": [
    "日喀则",
    "日照"
    ]
    },
    {
    "letter": "S",
    "citylist": [
    "三亚",
    "三明",
    "三沙",
    "三门峡",
    "上海",
    "上饶",
    "十堰",
    "双鸭山",
    "商丘",
    "商洛",
    "四平",
    "宿州",
    "宿迁",
    "山南",
    "朔州",
    "松原",
    "汕头",
    "汕尾",
    "沈阳",
    "深圳",
    "石嘴山",
    "石家庄",
    "绍兴",
    "绥化",
    "苏州",
    "遂宁",
    "邵阳",
    "随州",
    "韶关"
    ]
    },
    {
    "letter": "T",
    "citylist": [
    "台东",
    "台中",
    "台北",
    "台南",
    "台州",
    "吐鲁番",
    "唐山",
    "塔城",
    "天水",
    "天津",
    "太原",
    "桃园",
    "泰安",
    "泰州",
    "通化",
    "通辽",
    "铁岭",
    "铜仁",
    "铜川",
    "铜陵"
    ]
    },
    {
    "letter": "U",
    "citylist": []
    },
    {
    "letter": "V",
    "citylist": []
    },
    {
    "letter": "W",
    "citylist": [
    "乌兰察布",
    "乌海",
    "乌鲁木齐",
    "吴忠",
    "威海",
    "文山",
    "无锡",
    "梧州",
    "武威",
    "武汉",
    "温州",
    "渭南",
    "潍坊",
    "芜湖"
    ]
    },
    {
    "letter": "X",
    "citylist": [
    "信阳",
    "兴安盟",
    "厦门",
    "咸宁",
    "咸阳",
    "孝感",
    "宣城",
    "徐州",
    "忻州",
    "新乡",
    "新余",
    "新北",
    "新界",
    "新竹",
    "湘潭",
    "湘西",
    "襄阳",
    "西双版纳",
    "西咸",
    "西宁",
    "西安",
    "许昌",
    "邢台",
    "锡林郭勒盟",
    "香港岛"
    ]
    },
    {
    "letter": "Y",
    "citylist": [
    "云林",
    "云浮",
    "伊春",
    "伊犁",
    "宜兰",
    "宜宾",
    "宜昌",
    "宜春",
    "岳阳",
    "延安",
    "延边",
    "扬州",
    "榆林",
    "永州",
    "烟台",
    "玉林",
    "玉树",
    "玉溪",
    "益阳",
    "盐城",
    "营口",
    "运城",
    "银川",
    "阳江",
    "阳泉",
    "雅安",
    "鹰潭"
    ]
    },
    {
    "letter": "Z",
    "citylist": [
    "中卫",
    "中山",
    "周口",
    "张家口",
    "张家界",
    "张掖",
    "彰化",
    "新直辖县",
    "昭通",
    "枣庄",
    "株洲",
    "淄博",
    "湛江",
    "漳州",
    "珠海",
    "琼直辖县",
    "肇庆",
    "自贡",
    "舟山",
    "舟山新区",
    "豫直辖县",
    "资阳",
    "遵义",
    "郑州",
    "鄂直辖县",
    "重庆",
    "镇江",
    "驻马店"
    ]
    }
    ]
    }
    }


    module.exports = citylist;